NOT_REGISTERED_ERROR = (
    'Для этой команды необходимо зарегистрироваться в боте. '
    'Сделать это можно командой /регистрация ваш_никнейм_в_политопии'
)

EMPTY_DESCRIPTION_ERROR = 'Описание игры не может быть пустым. Оно указывается после имени команды через пробел.'
DESCRIPTION_TOO_LONG_ERROR = 'Описание игры слишком длинное. Чтобы открыть игру, вам нужно сделать его короче.'
FFA_GAME_OPENED = 'Игра {game_id} успешно создана!'

GAME_NOT_FOUND_ERROR = 'Не удалось найти игру с таким айди.'

ALREADY_JOINED_ERROR = 'Вы уже вступили в эту игру.'
JOINED_FFA_GAME = 'Вы успешно присоединились к игре {game_id}.'

MISSING_ID_ERROR = 'После имени команды необходимо указать айди игры через пробел.'
INVALID_ID_SYNTAX_ERROR = 'Вы указали некорректный айди, не удалось распознать его как число.'
